{
  "films": [
    {
      "id": "1",
      "title": "The Lighthouse",
      "genre": "Horror/Dark Comedy",
      "description": "From Robert Eggers, the visionary filmmaker behind modern horror masterpiece The Witch, comes this hypnotic and hallucinatory tale of two lighthouse keepers on a remote and mysterious New England island in the 1890s.",
      "releaseDate": "2020",
      "filmImage": "https://d135u4jtzauizi.cloudfront.net/_thumbnail/LIGOS_105_M3.1V2.1.jpg",
      "watched": "Yes"
    },
    {
      "id": "2",
      "title": "Uncut Gems",
      "genre": "Dark Comedy",
      "description": "From acclaimed filmmakers Josh and Benny Safdie comes an electrifying crime thriller about Howard Ratner (Adam Sandler), a charismatic New York City jeweler always on the lookout for the next big score. When he makes a series of high-stakes bets that could lead to the windfall of a lifetime, Howard must perform a precarious high-wire act, balancing business, family, and encroaching adversaries on all sides, in his relentless pursuit of the ultimate win.",
      "releaseDate": "2019",
      "filmImage": "https://d135u4jtzauizi.cloudfront.net/_thumbnail/UG_Online_Teaser-1-Sheet.jpg",
      "watched": "Yes"
    },
    {
      "id": "3",
      "title": "The Florida Project",
      "genre": "Drama",
      "description": "Set on a stretch of highway just outside the imagined utopia of Disney World, The Florida Project follows six-year-old Moonee (Brooklynn Prince in a stunning breakout turn) and her rebellious mother Halley (Bria Vinaite, another major discovery) over the course of a single summer. The two live week to week at “The Magic Castle,” a budget motel managed by Bobby (a career-best Willem Dafoe), whose stern exterior hides a deep reservoir of kindness and compassion.",
      "releaseDate": "2017",
      "filmImage": "https://d135u4jtzauizi.cloudfront.net/_thumbnail/TheFloridaProject_KeyArt_DigitalKeyArt_RGB-FIN_25.jpg",
      "watched": "Yes"
    },
    {
      "title": "Hereditary",
      "genre": "Horror",
      "filmImage": "https://d135u4jtzauizi.cloudfront.net/_thumbnail/HEREDITARY_TEASER_FINISH_V2_HALFSIZE.jpg",
      "description": "When Ellen, the matriarch of the Graham family, passes away, her daughter's family begins to unravel cryptic and increasingly terrifying secrets about their ancestry. The more they discover, the more they find themselves trying to outrun the sinister fate they seem to have inherited. Making his feature debut, writer-director Ari Aster unleashes a nightmare vision of a domestic breakdown that exhibits the craft and precision of a nascent auteur, transforming a familial tragedy into something ominous and deeply disquieting, and pushing the horror movie into chilling new terrain with its shattering portrait of heritage gone to hell.",
      "id": "7kaTR2g"
    }
  ]
}